Need to add jog in order to satisfy constraints
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId AssocpropNeedJog { get; }
  Visual Basic
Public Shared ReadOnly Property AssocpropNeedJog As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ AssocpropNeedJog {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DimensionFailures Class
  Autodesk.Revit.DB Namespace